<details>
<summary>Execution result of "run --all --non-interactive --summary-per-unit --log-level stderr --log-format bare -- plan" in "IaC/production/homelab"</summary>

```terraform


Initializing the backend...
Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
helm_release.nfs_subdir_external_provisioner: Refreshing state... [id=nfs-subdir-external-provisioner]
helm_release.nfs_database: Refreshing state... [id=nfs-subdir-external-provisioner-database]
helm_release.nfs_media: Refreshing state... [id=nfs-subdir-external-provisioner-media]
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.metallb_system: Refreshing state... [id=metallb-system]
helm_release.metallb: Refreshing state... [id=metallb]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
kubernetes_namespace_v1.metrics: Refreshing state... [id=metrics-server]
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.longhorn_system: Refreshing state... [id=longhorn-system]
helm_release.release: Refreshing state... [id=metrics-server]
helm_release.longhorn: Refreshing state... [id=longhorn]
kubernetes_namespace_v1.external_secrets: Refreshing state... [id=external-secrets]
kubernetes_secret_v1.name: Refreshing state... [id=external-secrets/aws-ssm-secret]
helm_release.release: Refreshing state... [id=external-secrets]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
kubernetes_manifest.ip_address_pool: Refreshing state...
kubernetes_manifest.l2_advertisement: Refreshing state...

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
- Installing hashicorp/helm v3.1.1 to the shared cache directory...
kubernetes_manifest.external_secrets_secret_store: Refreshing state...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/helm v3.1.1 from the shared cache directory
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory
- Installing hashicorp/kubernetes v3.0.1 to the shared cache directory...
- Installing hashicorp/aws v6.27.0 to the shared cache directory...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/kubernetes v3.0.1 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!
kubernetes_namespace_v1.traefik: Refreshing state... [id=traefik]
- Installed hashicorp/aws v6.27.0 (signed, key ID 0C0AF313E5FD9F80)
- Using hashicorp/aws v6.27.0 from the shared cache directory

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
kubernetes_namespace_v1.argocd: Refreshing state... [id=argocd]
aws_ssm_parameter.argocd["client_secret"]: Refreshing state... [id=/homelab/argocd/client_secret]
helm_release.traefik: Refreshing state... [id=traefik]
helm_release.argocd_image_updater: Refreshing state... [id=argocd-image-updater]
helm_release.release: Refreshing state... [id=argocd]

Planning failed. OpenTofu encountered an error while generating this plan.

╷
│ Error: Plugin error
│ 
│ The plugin returned an unexpected error from
│ plugin6.(*GRPCProvider).UpgradeResourceState: rpc error: code = Unknown
│ desc = failed to determine resource type ID: cannot get OpenAPI foundry:
│ failed get OpenAPI spec: context deadline exceeded
╵

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place (current -> planned)

OpenTofu planned the following actions, but then encountered a problem:

  # helm_release.argocd_image_updater will be updated in-place
  ~ resource "helm_release" "argocd_image_updater" {
      ~ id                         = "argocd-image-updater" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v1.0.2" -> (known after apply)
          ~ chart          = "argocd-image-updater" -> (known after apply)
          ~ first_deployed = 1754265078 -> (known after apply)
          ~ last_deployed  = 1767400104 -> (known after apply)
          ~ name           = "argocd-image-updater" -> (known after apply)
          ~ namespace      = "argocd" -> (known after apply)
          ~ notes          = "" -> (known after apply)
          ~ revision       = 16 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - extraArgs = [
                      - "--interval",
                      - "2m",
                    ]
                }
            ) -> (known after apply)
          ~ version        = "1.0.4" -> (known after apply)
        } -> (known after apply)
        name                       = "argocd-image-updater"
      ~ set_wo                     = (write-only attribute)
      ~ version                    = "1.0.4" -> "1.0.5"
        # (27 unchanged attributes hidden)
    }

  # helm_release.release will be created
  + resource "helm_release" "release" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 1500
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                "applicationSet":
                  "metrics":
                    "enabled": true
                    "serviceMonitor":
                      "additionalLabels":
                        "release": "prometheus"
                      "enabled": true
                      "selector":
                        "release": "prometheus"
                "configs":
                  "cm":
                    "accounts.app_user": "apiKey"
                    "accounts.app_user.enabled": true
                    "dex.config": |
                      "connectors":
                      - "config":
                          "clientID": "5dd3e953-5c5d-4854-b284-a9f1fd0d00fa"
                          "clientSecret": "${dex.azure.clientSecret}"
                          "redirectURI": "https://argocd.stinkyboi.com/api/dex/callback"
                          "tenant": "2aee152b-5281-40d0-8f4b-60faf40514ab"
                        "id": "microsoft"
                        "name": "Azure"
                        "type": "microsoft"
                  "params":
                    "server.insecure": "true"
                  "rbac":
                    "create": true
                    "policy.csv": |
                      p, app_user, *, *, *, allow
                    "policy.default": "role:admin"
                  "secret":
                    "createSecret": true
                "controller":
                  "metrics":
                    "enabled": true
                    "serviceMonitor":
                      "additionalLabels":
                        "release": "prometheus"
                      "enabled": true
                      "selector":
                        "release": "prometheus"
                "global":
                  "addPrometheusAnnotations": "false"
                  "domain": "argocd.stinkyboi.com"
                  "env":
                  - "name": "dex.azure.clientSecret"
                    "valueFrom":
                      "secretKeyRef":
                        "key": "client_secret"
                        "name": "dex-oidc-secret"
                "image":
                  "pullPolicy": "Always"
                "notifications":
                  "metrics":
                    "enabled": true
                    "serviceMonitor":
                      "additionalLabels":
                        "release": "prometheus"
                      "enabled": true
                      "selector":
                        "release": "prometheus"
                "repoServer":
                  "metrics":
                    "enabled": true
                    "serviceMonitor":
                      "additionalLabels":
                        "release": "prometheus"
                      "enabled": true
                      "selector":
                        "release": "prometheus"
                "server":
                  "certificate":
                    "enabled": true
                    "issuer":
                      "group": "cert-manager.io"
                      "kind": "ClusterIssuer"
                      "name": "cloudflare-clusterissuer"
                    "secretName": "argocd-server-tls"
                  "ingress":
                    "annotations":
                      "traefik.ingress.kubernetes.io/router.entrypoints": "websecure"
                    "enabled": true
                    "ingressClassName": "traefik"
                    "tls": true
                  "metrics":
                    "enabled": true
                    "serviceMonitor":
                      "additionalLabels":
                        "release": "prometheus"
                      "enabled": true
                      "selector":
                        "release": "prometheus"
            EOT,
        ]
      + verify                     = false
      + version                    = "9.4.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 1 to change, 0 to destroy.
╷
│ Error: Plugin error
│ 
│ The plugin returned an unexpected error from
│ plugin6.(*GRPCProvider).UpgradeResourceState: rpc error: code = Unknown
│ desc = failed to determine resource type ID: cannot get OpenAPI foundry:
│ failed get OpenAPI spec: context deadline exceeded
╵
╷
│ Error: Plugin error
│ 
│ The plugin returned an unexpected error from
│ plugin6.(*GRPCProvider).UpgradeResourceState: rpc error: code = Unknown
│ desc = failed to determine resource type ID: cannot get OpenAPI foundry:
│ failed get OpenAPI spec: context deadline exceeded
╵

❯❯ Run Summary  21 units  1m
   ────────────────────────────
   Succeeded (5)
      external-secrets .. 33s
      metallb ........... 16s
      longhorn .......... 11s
      metrics ........... 11s
      storage ........... 8s
   Failed (2)
      argocd ............ 1m
      traefik ........... 1m
   Early Exits (14)
      cert-manager ...... 1µs
      cloudflare-tunnel . 1µs
      tailscale ......... 795ns
      octobot ........... 756ns
      n8n ............... 692ns
      database .......... 556ns
      litellm ........... 554ns
      open-webui ........ 553ns
      technitium ........ 551ns
      descheduler ....... 489ns
      homarr ............ 447ns
      minecraft ......... 424ns
      monitoring ........ 423ns
      homeassistant ..... 414ns
```

</details>
    
